package app.format;

import app.model.Task;

public class UpdateFormat extends BaseFormat{

    public static String taskFormat(Task task) {
        return "\n═══════════════════════════════════════════════=\n"
                +
                "═════════════Обновленная задача═══════════════=\n"
                +
                "══════════════════════════════════════════════=\n"
                +
                task.getName()
                +
                "\n─────────────────────────────────────────────"
                +
                "\nСтадия выполнения: " + task.getStage()
                +
                "\nОценка важности: " + task.getImportanceLevel()
                +
                "\nЦели: "
                +
                task.getBody()
                +
                "\n─────────────────────────────────────────────"
                +
                "\nДата создания: " + task.getCreatedAt()
                +
                "\nСрок выполнения до - " + task.getDueDate()
                +
                "\n═════════════════════════════════════════════\n";

    }
}
